results/glm52_b200_i8k_o16_c64_bench.log
/sgl-workspace/squidward/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8552, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model=None, served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=16, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=4, profile_by_stage=True, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:8552/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8552, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/hf_home/hub/models--nvidia--GLM-5.2-NVFP4/snapshots/aec724e8c7b8ee9db3b48c01c320f63f9cdaf8aa', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=16, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=True, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=4, profile_by_stage=True, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2097152
#Output tokens: 4096
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Starting profiler...
async_request_profile api_url='http://0.0.0.0:8552/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': 4, 'profile_by_stage': True, 'profile_stages': None, 'output_dir': '/root/hf_home/traces/glm52_b200_i8k_o16/traces/1785785573.0441978', 'profile_prefix': None}
Profiler started
100%|██████████| 256/256 [01:50<00:00,  2.32it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     256       
Benchmark duration (s):                  110.18    
Total input tokens:                      2097152   
Total input text tokens:                 2097152   
Total generated tokens:                  4096      
Total generated tokens (retokenized):    4095      
Request throughput (req/s):              2.32      
Input token throughput (tok/s):          19033.76  
Output token throughput (tok/s):         37.18     
Peak output token throughput (tok/s):    704.00    
Peak concurrent requests:                128       
Total token throughput (tok/s):          19070.94  
Concurrency:                             63.98     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   27538.22  
Median E2E Latency (ms):                 21525.36  
P90 E2E Latency (ms):                    46505.44  
P95 E2E Latency (ms):                    46506.50  
P99 E2E Latency (ms):                    46507.69  
---------------Time to First Token----------------
Mean TTFT (ms):                          13104.13  
Median TTFT (ms):                        13298.56  
P90 TTFT (ms):                           22979.34  
P95 TTFT (ms):                           27080.94  
P99 TTFT (ms):                           29750.75  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          962.27    
Median TPOT (ms):                        909.45    
P90 TPOT (ms):                           1806.18   
P95 TPOT (ms):                           2054.78   
P99 TPOT (ms):                           2966.54   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           962.52    
Median ITL (ms):                         93.91     
P90 ITL (ms):                            187.04    
P95 ITL (ms):                            9324.08   
P99 ITL (ms):                            15813.77  
Max ITL (ms):                            29678.83  
==================================================